---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralAssetParam
source: html/bc84e9dc-ec7b-f5f6-2f3b-6a43de61fd6e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralAssetParam Property

"Physical Material Asset"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralAssetParam { get; }
```